// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СгенерироватьДанные() Экспорт
	
	ТекстМакета = ПолучитьМакет("СлучайныеФИО").ПолучитьТекст();
	СписокПосетителей = СтрРазделить(ТекстМакета, Символы.ПС);
	
	КоличествоПосетителей = СписокПосетителей.Количество();
	СписокАттракционов = СписокАттракционов(); 
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	Курсор = Период.ДатаНачала;
	
	// Рассчитываем каждый день периода
	// В понедельник парк не работает
	// Определяем сколько посетителей придет в парк
	// Коэффициент в выходные дни = 1,5
	// Выбираем случайных посетителей из списка
	Пока Курсор < Период.ДатаОкончания Цикл
		
		Если ДеньНедели(Курсор) = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		КоэффициентПосетителей = 1;
		
		Если ДеньНедели(Курсор) >= 6 Тогда
			КоэффициентПосетителей = 1.5; 
		КонецЕсли;
		
		КоличествоПосетителей = ГСЧ.СлучайноеЧисло(10, 30) * КоэффициентПосетителей;
		
		Для НомерПосетителя = 1 По КоличествоПосетителей Цикл
			
			ИндексСлучайногоПосетителя = ГСЧ.СлучайноеЧисло(0, 99);
			
			ФИОПосетителя = СписокПосетителей[ИндексСлучайногоПосетителя];
			
			Посетитель = ПолучитьПосетителя(ФИОПосетителя);
			
			СформироватьПосещениеПосетителя(Посетитель, Курсор, ГСЧ); 
			
		КонецЦикла; 
		
		Курсор = Курсор + 86400;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СписокАттракционов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"" 
		
	
КонецФункции

Процедура СформироватьПосещениеПосетителя(Посетитель, Дата, ГСЧ = Неопределено)
	
	Если ГСЧ = Неопределено Тогда
		ГСЧ = Новый ГенераторСлучайныхЧисел();
	КонецЕсли;
	
	// Для каждого посетителя выбираем на сколько аттракционов он пойдет
	// Проверяем для каждого посещения есть ли билет, если билета нет - покупаем доступный для нужного аттракциона
	// Регистрируем посещение
	
	КоличествоАттракционов = ГСЧ.СлучайноеЧисло(1, 7);
	
	Для Сч = 1 По 7 Цикл
		
		
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПосетителя(ФИОПосетителя)
	
	Результат = Справочники.Клиенты.НайтиПоНаименованию(ФИОПосетителя, Истина);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		
		СпрОбЪект = Справочники.Клиенты.СоздатьЭлемент();
		СпрОбЪект.Заполнить(Неопределено);
		СпрОбЪект.Наименование = ФИОПосетителя;
		Если Не СпрОбЪект.ПроверитьЗаполнение() Тогда
			ВызватьИсключение "Ошибка создания клиента";
		КонецЕсли;
		СпрОбЪект.Записать();
		Результат = СпрОбЪект.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
